package main

import "fmt"

// Пример рекурсивного расчета факториала
func factorial(n int) int {
	// Базовый случай
	if n == 0 {
		return 1
	}
	return n * factorial(n-1)

}

// Другой пример рекурсивной функции
func countDown(n int) {
	// Базовый случай
	if n <= 0 {
		fmt.Println("Поехали!")
	} else {
		fmt.Println(n)
		countDown(n - 1)
	}
}

// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// ------------------------------- Клиентский код -------------------------------
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
func main() {
	fmt.Println(factorial(5)) // => 120
	countDown(5)              // => 5 4 3 2 1 Поехали!
}
